mesh1/0.org/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    AMI_r
    {
        type            cyclicAMI;
        value           uniform (0 0 0);
    }
    AMI_s
    {
        type            cyclicAMI;
        value           uniform (0 0 0);
    }
    baffle
    {
        type            movingWallVelocity;
        value           uniform (0 0 0);
    }
    r_shaft
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    s_shaft
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    impeller
    {
        type            movingWallVelocity;
        value           uniform (0 0 0);
    }
    motor
    {
        type            fixedValue;
        value           uniform (0 0 0);
    } 
    domain
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }    
    inlet
    {
        type            zeroGradient;
    }
    outlet
    {
        type            zeroGradient;
    }
    

}

// ************************************************************************* //
