mesh1/0.org/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.00341;

boundaryField       
{
    AMI_r
    {
        type            cyclicAMI;
        value           uniform 0.00341;
    }
    AMI_s
    {
        type            cyclicAMI;
        value           uniform 0.00341;
    }
    baffle
    {   
        type            kqRWallFunction;
        value           uniform 0;
    }
    r_shaft
    {
        type            kqRWallFunction;
        value           uniform 0;
    }
    s_shaft
    {
        type            kqRWallFunction;
        value           uniform 0;
    }
    impeller
    {
        type            kqRWallFunction;
        value           uniform 0;
    }
    motor
    {
        type            kqRWallFunction;
        value           uniform 0;
    } 
    domain
    {
        type            kqRWallFunction;
        value           uniform 0;
    }    
    inlet
    {
        type turbulentIntensityKineticEnergyInlet;
        intensity 0.05;
        value $internalField; 
    }
    outlet
    {
        type            calculated;            
        value           uniform 0; 
    }
    
}


// ************************************************************************* //
