mesh1/0.org/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 1e-5;

boundaryField
{
    AMI_r
    {
        type            cyclicAMI;
        value           uniform 1e-5;
    }
    AMI_s
    {
        type            cyclicAMI;
        value           uniform 1e-5;
    }
   
    baffle
    {   
        type            nutkWallFunction;
        value           uniform 1e-5;
    }
    r_shaft
    {
        type            nutkWallFunction;
        value           uniform 1e-5;
    }
    s_shaft
    {
        type            nutkWallFunction;
        value           uniform 1e-5;   
     }
    impeller
    {
        type            nutkWallFunction;
        value           uniform 1e-5;  
    } 
    motor
    {
        type            nutkWallFunction;
        value           uniform 1e-5;  
    } 
    domain
    {
        type            nutkWallFunction;
        value           uniform 1e-5;  
    }    
    inlet
    {
        type            calculated;            
        value           uniform 0; 
    }
    outlet
    {
        type            calculated;            
        value           uniform 0; 
    }

}

// ************************************************************************* //
