mesh1/0.org/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    AMI_r
    {
        type            cyclicAMI;
        value           uniform 0;
    }
    AMI_s
    {
        type            cyclicAMI;
        value           uniform 0;
    }
    
    inlet
    {
        type            zeroGradient;
    }
    outlet
    {
        type            zeroGradient;
    }
    baffle
    {
        type            fixedFluxPressure;
        value           uniform 0;
    }
    r_shaft
    {
        type            fixedFluxPressure;
        value           uniform 0;
    }
    s_shaft
    {
        type            fixedFluxPressure;
        value           uniform 0;
    }  
    domain
    {
        type            fixedFluxPressure;
        value           uniform 0;
    }
    impeller
    {
        type            fixedFluxPressure;
        value           uniform 0;
    }
    motor
    {
        type            fixedFluxPressure;
        value           uniform 0;
    }
 
}

// ************************************************************************* //
