mesh1/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;

vertices
(
    ( -3 -3 -3)  //0
    (  3 -3 -3)  //1
    (  3  3 -3)  //2
    ( -3  3 -3)  //3
    ( -3 -3  3)  //4
    (  3 -3  3)  //5
    (  3  3  3)  //6
    ( -3  3  3)  //8
  

);

blocks
(
    hex (0 1 2 3 4 5 6 7) (50 50 50) simpleGrading (1 1 1)
);

edges
(
);

boundary
(

    allBoundary
    {
        type patch;
        faces
        ( 
            (1 5 4 0)
            (3 7 6 2)
            (0 4 7 3)
            (2 6 5 1)
            (0 3 2 1)
            (4 5 6 7)
        );
    }
);

// ************************************************************************* //
