mesh1/system/createPatchDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      createPatchDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

pointSync false;

patches
(
    {
        //- Master side patch
        name            outlet;
        patchInfo
        {
            type           patch;
        }
        constructFrom patches;
        patches (allBoundary);
    }

  /*  {
        //- Master side patch
        name            AMI_s;
        patchInfo
        {
            type           patch;
        }
        constructFrom patches;
        patches (AMI);
    }  */
);

// ************************************************************************* //
