mesh1/system/snappyHexMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      snappyHexMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

castellatedMesh true;
snap            true;
addLayers       false;

geometry
{
    
    s_shaft.stl{ type triSurfaceMesh; name s_shaft;}
    AMI.stl{ type triSurfaceMesh; name AMI;}
    baffle.stl{ type triSurfaceMesh; name baffle;}
    motor.stl{ type triSurfaceMesh; name motor;}
    domain.stl{ type triSurfaceMesh; name domain;}
    inlet.stl{ type triSurfaceMesh; name inlet;}
    outlet.stl{ type triSurfaceMesh; name outlet;}
}

castellatedMeshControls
{
    maxLocalCells 100000;
    maxGlobalCells 8000000;
    minRefinementCells 0;
    maxLoadUnbalance 0.10;
    nCellsBetweenLevels 2;

    features
    (
        { file "s_shaft.eMesh"; level 0;}
        { file "AMI.eMesh"; level 1;}
        { file "baffle.eMesh"; level 1;} // Note: better: level 3
        { file "motor.eMesh"; level 0;}
        { file "domain.eMesh"; level 0;}
        { file "inlet.eMesh"; level 0;}
        { file "outlet.eMesh"; level 0;}
   
    );

    refinementSurfaces
    {
        s_shaft{ level (0 0);}
        AMI{ level (0 0);}
        baffle{ level (2 2);} // Note: better: levels 3 3   
        motor{ level (0 0);}
        domain{ level (0 0);}
        inlet{ level (0 0);}
        outlet{ level (0 0);}
    }

    resolveFeatureAngle 30;

    refinementRegions
    {
	    // Note: for better mesh quality utilize this refinement region
    }

    locationInMesh (0.0 1.0 0.0);
    allowFreeStandingZoneFaces false;
}

snapControls
{
    nSmoothPatch 3;
    tolerance 2.0; 
    nSolveIter 300;
    nRelaxIter 5;
    nFeatureSnapIter 10;
    implicitFeatureSnap true;
    explicitFeatureSnap false;
    multiRegionFeatureSnap true;
}

addLayersControls
{
    relativeSizes true;

    layers
    {
    }

    expansionRatio 1.0;
    finalLayerThickness 0.3;
    minThickness 0.1;
    nGrow 0;
    featureAngle 30;
    nRelaxIter 3;
    nSmoothSurfaceNormals 1;
    nSmoothNormals 3;
    nSmoothThickness 10;
    maxFaceThicknessRatio 0.5;
    maxThicknessToMedialRatio 0.3;
    minMedialAxisAngle 90;
    nBufferCellsNoExtrude 0;
    nLayerIter 50;
}

meshQualityControls
{
    maxNonOrtho 65;
    maxBoundarySkewness 20;
    maxInternalSkewness 4;
    maxConcave 80;
    minVol 1e-13;
    minTetQuality -1;
    minArea -1;
    minTwist 0.01;
    minDeterminant 0.001;
    minFaceWeight 0.05;
    minVolRatio 0.01;
    minTriangleTwist -1;
    nSmoothScale 4;
    errorReduction 0.75;
    relaxed
    {
        maxNonOrtho 75;
    }
}

mergeTolerance 1e-6;

// ************************************************************************* //
